{"weblogs" : [
{
	"id" : 1,
	"w_title" : "First weblog",
	"w_content" : "This is the content of the first weblog",
	"w_dateposted" : "1446712301133",
	"w_category" : "Random",
	"w_weight" : 1,
	"w_visible" : 1
}, 
{
	"id" : 2,
	"w_title" : "currentTimeInMillis() and why you should use it",
	"w_content" : "The definition is simple. It returns the difference, in milliseconds, between the current time and midnight of Jan 1, 1970 UTC. (Btw, UTC is GMT, theyre both the same.) So, why use this method? While developing, CTIM is the most convenient way to send timestamps from device to servers. You dont have to worry about maintaining a standard format of storing date and time, (so now worrying about whether its mm:dd:yy or dd:mm:yy), and manipulation of timestamp is super easy as well. The method returns a long in Java, which can be transformed to print whichever date format you want on the frontend, keeping the backend simple. Wait. But hold on, there's a catch. The current time in America is 6am, and over here its 3pm. Will currentTimeInMillis() return the same time for both? Of course it will.",
	"w_dateposted" : "1446806460406",
	"w_category" : "Code",
	"w_weight" : 2,
	"w_visible" : 1
}, 
{
	"id" : 3,
	"w_title" : "Android - the Theory *snore*",
	"w_content" : "I know how to develop apps in Android and I'm good. I've done it for the past 2 years (as of Nov '15) but I fear if people ask me theoretical questions like the android activity cycle, and questions on gradle and ant build, its a little embarassing not knowing how to answer using the correct keywords. So here's a post on the stuff you should know while sitting for an Android interview.",
	"w_dateposted" : "1446712301133",
	"w_category" : "Code",
	"w_weight" : 3,
	"w_visible" : 1
},
{
	"id" : 4,
	"w_title" : "Go on, Read this",
	"w_content" : "Hahahhahahahahhaha",
	"w_dateposted" : "1446712301133",
	"w_category" : "Happy",
	"w_weight" : 3,
	"w_visible" : 1
},
{
	"id" : 5,
	"w_title" : "",
	"w_content" : "",
	"w_dateposted" : "1446712301133",
	"w_category" : "",
	"w_weight" : 3,
	"w_visible" : 1
}

]
}